Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions
The Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions class adds extension methods to the Tekla.Structures.Model.Component type.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions.GetInputPoints(Tekla.Structures.Model.Component)
Gets the current input points from the component.
component: The component.
Returns:
A System.Collections.Generic.List`1 that contains the input points as of type Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions.GetInputPoints(Tekla.Structures.Model.CustomPart)
Gets the current input points from the custom part.
component: The custom part.
Returns:
A System.Collections.Generic.List`1 that contains the input points as of type Tekla.Structures.Geometry3d.Point.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions.GetAppliedAttributes(Tekla.Structures.Model.Component)
Gets the applied attributes of the component.
component: The component.
Returns:
The System.Collections.Generic.Dictionary`2 of applied attributes.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions.SetAppliedAttributes(Tekla.Structures.Model.Component,System.Collections.Generic.Dictionary{System.String,System.Object})
Sets the applied attributes of the component.
component: The component.
attributes: The attributes.
Returns:
A System.Boolean to indicate whether the setting succeded.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions.GetAppliedAttributes(Tekla.Structures.Model.CustomPart)
Gets the applied attributes of the custom part.
customPart: The custom part.
Returns:
The System.Collections.Generic.Dictionary`2 of applied attributes.

Tekla.Structures.Plugins.DirectManipulation.Services.Utilities.ComponentExtensions.SetAppliedAttributes(Tekla.Structures.Model.CustomPart,System.Collections.Generic.Dictionary{System.String,System.Object})
Sets the applied attributes of the custom part.
customPart: The custom part.
attributes: The attributes.
Returns:
A System.Boolean to indicate whether the setting succeded.